module.exports = {
    name: 'سري',
    async execute(sock, m, args, db, sender) {
        const id = m.key.remoteJid;

        let msg = `⚠️ *بَوَّابَةُ السُّوقِ السَّوْدَاءِ - الْعَنَاصِرُ الْمُحَرَّمَةُ* ⚠️\n`;
        msg += `━━━━━━━━━━━━━━━━━━━━\n\n`;

        const secretItems = [
            { id: "404", n: "خَطَأُ النِّظَامِ (System Error) ⚠️", p: "1.5B" },
            { id: "77",  n: "كُودُ الْغِشِّ (Cheat Code) ⌨️", p: "5B" },
            { id: "0",   n: "جَوْهَرَةُ الْعَدَمِ (The Void) 🌑", p: "15B" },
            { id: "502", n: "بَوَّابَةُ السِّيرْفَرِ الْمُنْفَجِرَةُ 🔥", p: "40B" },
            { id: "101", n: "خُوذَةُ الْمُشْرِفِ الْأَعْلَى 🎧", p: "100B" },
            { id: "666", n: "عَقْدُ الشَّيْطَانِ الْمَبْرَمِ 📜", p: "300B" },
            { id: "7",   n: "شَبَحُ الْمُطَوِّرِ الْأَوَّلِ 👻", p: "600B" },
            { id: "999", n: "صَلَاحِيَّةُ الْجَذْرِ (ROOT) 🔑", p: "1T" }
        ];

        secretItems.forEach(i => {
            msg += `*ID: [ ${i.id} ]* ⇠ *${i.n}*\n   💰 الثمن: [ *${i.p}* ]\n`;
            msg += `┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈\n`;
        });

        msg += `\n☣️ *تنبيه:* هذه العناصر لا تخضع لقوانين الفيزياء!\n🛒 للشراء: *.شراء_سري [الرقم]*`;
        await sock.sendMessage(id, { text: msg }, { quoted: m });
    }
};
